import binascii

# Данные из задания
n = 115428760148678783449397311601064883625786046307762478994599069605010515503553274519829212985680248151032697030314656160021143599982114889004339162886288407395961513392995299517693253483839245550922422509910768669788553104202625453669289947707774640020165369152414849283958442798807424424286547573110501369123
e = 3
c = 268242604594630989772621181645302553590291432923184702628312525275029733648564776832635566026162886179557921300889229254479408974649344119324335280753704070037661541


def find_cube_root(target):
    low = 1
    high = target

    while low <= high:
        mid = (low + high) // 2
        cube = mid ** 3

        if cube == target:
            return mid
        elif cube < target:
            low = mid + 1
        else:
            high = mid - 1

    return -1


m = find_cube_root(c)

if m != -1:
    print(f"[*] Целое число (plaintext) найдено: {m}")

    hex_string = hex(m)[2:]


    if len(hex_string) % 2 != 0:
        hex_string = '0' + hex_string

    try:
        flag = binascii.unhexlify(hex_string).decode('utf-8')
        print(f"\n[+] Флаг успешно восстановлен:\n{flag}")
    except Exception as error:
        print(f"[-] Ошибка при декодировании текста: {error}")
else:
    print("[-] Не удалось найти точный кубический корень. Возможно, сообщение было больше модуля n.")